#  stack & unstack
 - stack : 컬럼 레벨에서 인덱스 레벨(row 레벨)로 dataframe 변경
  - 즉, 데이터를 쌓아올리는 개념으로 이해하면 쉬움
 - unstack : 인덱스 레벨에서 컬럼 레벨로 dataframe 변경
  - stack의 반대 operation
 
 - 둘은 역의 관계에 있음

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.DataFrame({
    '지역' : ['서울','서울','서울','경기','경기','부산','서울','서울'],
    '요일' : ['월요일','화요일','수요일','월요일','금요일','토요일','일요일','월요일'],
    '강수량' : [100,80,1000,200,200,100,50,100],
    '강수확률' : [80,70,90,10,20,30,50,90]

})
df

   지역   요일   강수량  강수확률
0  서울  월요일   100    80
1  서울  화요일    80    70
2  서울  수요일  1000    90
3  경기  월요일   200    10
4  경기  금요일   200    20
5  부산  토요일   100    30
6  서울  일요일    50    50
7  서울  월요일   100    90

In [3]:
new_df = df.set_index(['지역','요일'])

In [4]:
new_df

         강수량  강수확률
지역 요일
서울 월요일   100    80
   화요일    80    70
   수요일  1000    90
경기 월요일   200    10
   금요일   200    20
부산 토요일   100    30
서울 일요일    50    50
   월요일   100    90

In [8]:
new_df = df.groupby(['지역','요일'])['강수량'].mean()

In [10]:
new_df

지역  요일
경기  금요일     200.0
    월요일     200.0
부산  토요일     100.0
서울  수요일    1000.0
    월요일     100.0
    일요일      50.0
    화요일      80.0
Name: 강수량, dtype: float64

In [11]:
new_df.unstack()

요일    금요일     수요일    월요일   일요일    토요일   화요일
지역
경기  200.0     NaN  200.0   NaN    NaN   NaN
부산    NaN     NaN    NaN   NaN  100.0   NaN
서울    NaN  1000.0  100.0  50.0    NaN  80.0

In [12]:
new_df.unstack(-1)

요일    금요일     수요일    월요일   일요일    토요일   화요일
지역
경기  200.0     NaN  200.0   NaN    NaN   NaN
부산    NaN     NaN    NaN   NaN  100.0   NaN
서울    NaN  1000.0  100.0  50.0    NaN  80.0

In [13]:
new_df.unstack(0)

지역      경기     부산      서울
요일
금요일  200.0    NaN     NaN
수요일    NaN    NaN  1000.0
월요일  200.0    NaN   100.0
일요일    NaN    NaN    50.0
토요일    NaN  100.0     NaN
화요일    NaN    NaN    80.0

In [14]:
df2 = new_df.unstack(0)

In [15]:
df2.stack(0)

요일   지역
금요일  경기     200.0
수요일  서울    1000.0
월요일  경기     200.0
     서울     100.0
일요일  서울      50.0
토요일  부산     100.0
화요일  서울      80.0
dtype: float64

In [17]:
new_df.unstack().unstack()

요일   지역
금요일  경기     200.0
     부산       NaN
     서울       NaN
수요일  경기       NaN
     부산       NaN
     서울    1000.0
월요일  경기     200.0
     부산       NaN
     서울     100.0
일요일  경기       NaN
     부산       NaN
     서울      50.0
토요일  경기       NaN
     부산     100.0
     서울       NaN
화요일  경기       NaN
     부산       NaN
     서울      80.0
dtype: float64